app/views/orders/index.html.erb

      <tr>
        <td><%= order.order_no %></td>
---
SELECT "orders".* FROM "orders"