app/controllers/addresses_controller.rb

SELECT "addresses".* FROM "addresses"
---
  def index
    @addresses = Address.all

INSERT INTO "addresses" ("name", "phone", "addressL1", "addressL2", "city", "state", "country", "pin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @address = Address.new(address_params)

    respond_to do |format|
      if @address.save

UPDATE "addresses" SET "name" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["name", "Shashank "], ["updated_at", "2021-01-21 06:14:13.327937"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @address.update(address_params)

DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 1]]
---
  def destroy
    @address.destroy

SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_address
      @address = Address.find(params[:id])