app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("order_no", "order_date", "order_status", "billingaddr", "shippingaddr", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @order.destroy
---
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 1]]