app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("SKU", "MRP", "quantity", "discount", "netPrice", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["SKU", 123165], ["MRP", 1000000], ["quantity", 2], ["discount", 2.5], ["netPrice", 950000], ["created_at", "2021-01-21 05:14:41.039139"], ["updated_at", "2021-01-21 05:14:41.039139"]]